{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm0_add_beta_expand_sc", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm0_out", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_add", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv22_conv0_weight_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm1_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_add_relu", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "max_pool2d0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_max_pool2d_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_norm2_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm2_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu1", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul_broadcast_add_relu", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[6, 0, 0], [7, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "transpose0", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm3_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm3_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu2", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_winograd_without_weight_transform_broadcast_mul_broadcast_add_relu", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[9, 0, 0], [10, 0, 0], [11, 0, 0], [12, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "transpose1", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "elemwise_add0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_winograd_without_weight_transform_elemwise_add", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[13, 0, 0], [14, 0, 0], [6, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_norm4_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm4_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu3", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul_broadcast_add_relu", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[15, 0, 0], [16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "transpose2", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm5_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm5_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu4", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_winograd_without_weight_transform_broadcast_mul_broadcast_add_relu", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[18, 0, 0], [19, 0, 0], [20, 0, 0], [21, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "transpose3", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm6_add_beta_expand_sc", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu5", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_winograd_without_weight_transform_elemwise_add_broadcast_add_relu", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[22, 0, 0], [23, 0, 0], [15, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv22_stage2_conv0_weight_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm7_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm7_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu6", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_relu", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[25, 0, 0], [26, 0, 0], [27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "transpose4", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv22_stage2_conv2_weight_sc", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "conv2d7", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_3", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[25, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "elemwise_add2", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_winograd_without_weight_transform_elemwise_add_1", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[29, 0, 0], [30, 0, 0], [32, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_norm8_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm8_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu7", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul_broadcast_add_relu_1", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[33, 0, 0], [34, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "transpose5", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm9_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm9_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu8", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_winograd_without_weight_transform_broadcast_mul_broadcast_add_relu_1", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[36, 0, 0], [37, 0, 0], [38, 0, 0], [39, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "transpose6", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm10_add_beta_expand_sc", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu9", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_winograd_without_weight_transform_elemwise_add_broadcast_add_relu_1", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[40, 0, 0], [41, 0, 0], [33, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv22_stage3_conv0_weight_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm11_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm11_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu10", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_relu_1", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[43, 0, 0], [44, 0, 0], [45, 0, 0], [46, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "transpose7", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv22_stage3_conv2_weight_sc", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "conv2d12", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_4", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[43, 0, 0], [49, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "elemwise_add4", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_winograd_without_weight_transform_elemwise_add_2", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[47, 0, 0], [48, 0, 0], [50, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_norm12_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm12_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu11", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul_broadcast_add_relu_2", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[51, 0, 0], [52, 0, 0], [53, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "transpose8", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm13_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm13_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu12", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_winograd_without_weight_transform_broadcast_mul_broadcast_add_relu_2", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[54, 0, 0], [55, 0, 0], [56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "transpose9", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm14_add_beta_expand_sc", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu13", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_winograd_without_weight_transform_elemwise_add_broadcast_add_relu_2", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[58, 0, 0], [59, 0, 0], [51, 0, 0], [60, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv22_stage4_conv0_weight_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm15_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm15_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu14", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_relu_2", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[61, 0, 0], [62, 0, 0], [63, 0, 0], [64, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "transpose10", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv22_stage4_conv2_weight_sc", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "conv2d17", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_5", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[61, 0, 0], [67, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "elemwise_add6", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_winograd_without_weight_transform_elemwise_add_3", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[65, 0, 0], [66, 0, 0], [68, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_norm16_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm16_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu15", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul_broadcast_add_relu_3", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[69, 0, 0], [70, 0, 0], [71, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "transpose11", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm17_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm17_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu16", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_winograd_without_weight_transform_broadcast_mul_broadcast_add_relu_3", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[72, 0, 0], [73, 0, 0], [74, 0, 0], [75, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "transpose12", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm18_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm18_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu17", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_winograd_without_weight_transform_elemwise_add_broadcast_mul_broadcast_add_relu", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[76, 0, 0], [77, 0, 0], [69, 0, 0], [78, 0, 0], [79, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "global_avg_pool2d0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_global_avg_pool2d_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[80, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "__mul_scalar__0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_reshape_flatten___mul_scalar___1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[81, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv22_dense0_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "__mul_scalar__1", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "dense0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_dense_1", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[82, 0, 0], [83, 0, 0], [84, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    3, 
    4, 
    7, 
    8, 
    10, 
    11, 
    12, 
    14, 
    16, 
    17, 
    19, 
    20, 
    21, 
    23, 
    24, 
    26, 
    27, 
    28, 
    30, 
    31, 
    34, 
    35, 
    37, 
    38, 
    39, 
    41, 
    42, 
    44, 
    45, 
    46, 
    48, 
    49, 
    52, 
    53, 
    55, 
    56, 
    57, 
    59, 
    60, 
    62, 
    63, 
    64, 
    66, 
    67, 
    70, 
    71, 
    73, 
    74, 
    75, 
    77, 
    78, 
    79, 
    83, 
    84
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    77, 
    78, 
    79, 
    80, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86
  ], 
  "heads": [[85, 0, 0]], 
  "attrs": {
    "storage_id": ["list_int", [
        6, 
        7, 
        0, 
        8, 
        9, 
        1, 
        0, 
        10, 
        11, 
        1, 
        12, 
        13, 
        14, 
        2, 
        15, 
        1, 
        16, 
        17, 
        2, 
        18, 
        19, 
        20, 
        0, 
        21, 
        22, 
        2, 
        23, 
        24, 
        25, 
        0, 
        26, 
        27, 
        1, 
        2, 
        28, 
        29, 
        0, 
        30, 
        31, 
        32, 
        1, 
        33, 
        34, 
        0, 
        35, 
        36, 
        37, 
        2, 
        38, 
        39, 
        1, 
        0, 
        40, 
        41, 
        2, 
        42, 
        43, 
        44, 
        1, 
        45, 
        46, 
        2, 
        47, 
        48, 
        49, 
        0, 
        50, 
        51, 
        3, 
        2, 
        52, 
        53, 
        3, 
        54, 
        55, 
        56, 
        0, 
        57, 
        58, 
        59, 
        3, 
        4, 
        5, 
        60, 
        61, 
        4]], 
    "dtype": ["list_int", [
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0]], 
    "dltype": ["list_str", [
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32"]], 
    "shape": ["list_shape", [
        [1, 3, 224, 224], 
        [3, 1, 1], 
        [1, 3, 224, 224], 
        [64, 3, 7, 7], 
        [64, 1, 1], 
        [1, 64, 112, 112], 
        [1, 64, 56, 56], 
        [64, 1, 1], 
        [64, 1, 1], 
        [1, 64, 56, 56], 
        [6, 6, 64, 64], 
        [64, 1, 1], 
        [64, 1, 1], 
        [1, 64, 56, 56], 
        [6, 6, 64, 64], 
        [1, 64, 56, 56], 
        [64, 1, 1], 
        [64, 1, 1], 
        [1, 64, 56, 56], 
        [6, 6, 64, 64], 
        [64, 1, 1], 
        [64, 1, 1], 
        [1, 64, 56, 56], 
        [6, 6, 64, 64], 
        [64, 1, 1], 
        [1, 64, 56, 56], 
        [128, 64, 3, 3], 
        [128, 1, 1], 
        [128, 1, 1], 
        [1, 128, 28, 28], 
        [4, 4, 128, 128], 
        [128, 64, 1, 1], 
        [1, 128, 28, 28], 
        [1, 128, 28, 28], 
        [128, 1, 1], 
        [128, 1, 1], 
        [1, 128, 28, 28], 
        [4, 4, 128, 128], 
        [128, 1, 1], 
        [128, 1, 1], 
        [1, 128, 28, 28], 
        [4, 4, 128, 128], 
        [128, 1, 1], 
        [1, 128, 28, 28], 
        [256, 128, 3, 3], 
        [256, 1, 1], 
        [256, 1, 1], 
        [1, 256, 14, 14], 
        [4, 4, 256, 256], 
        [256, 128, 1, 1], 
        [1, 256, 14, 14], 
        [1, 256, 14, 14], 
        [256, 1, 1], 
        [256, 1, 1], 
        [1, 256, 14, 14], 
        [4, 4, 256, 256], 
        [256, 1, 1], 
        [256, 1, 1], 
        [1, 256, 14, 14], 
        [4, 4, 256, 256], 
        [256, 1, 1], 
        [1, 256, 14, 14], 
        [512, 256, 3, 3], 
        [512, 1, 1], 
        [512, 1, 1], 
        [1, 512, 7, 7], 
        [4, 4, 512, 512], 
        [512, 256, 1, 1], 
        [1, 512, 7, 7], 
        [1, 512, 7, 7], 
        [512, 1, 1], 
        [512, 1, 1], 
        [1, 512, 7, 7], 
        [4, 4, 512, 512], 
        [512, 1, 1], 
        [512, 1, 1], 
        [1, 512, 7, 7], 
        [4, 4, 512, 512], 
        [512, 1, 1], 
        [512, 1, 1], 
        [1, 512, 7, 7], 
        [1, 512, 1, 1], 
        [1, 512], 
        [1000, 512], 
        [1000], 
        [1, 1000]]]
  }
}